#include <stdio.h>

int main() {
    
    return 0;
}

/*
 Од стандарден влез се внесува  низа од природни броеви. Прво се внесува бројот на броеви што ќе се внесат (3 <= N <= 100), а потоа и елементите на низата.
 Да се напише програма што ќе го отпечати најголемиот елемент во низата за кој важи дека елементот што се наоѓа пред него и по него во низата има вредност
 помала од неговата. Ако во низата ниту еден делемент не го задоволува условот, се печати порака "No  element match the criteria".

 Наоѓањето на најголемиот елемент во низата што го задоволува дадениот услов треба да се реализира со посебна функција. Решенијата без користење функција ќе
 бидат оценети со најмногу 40% од поените.
 Пример:
 Влез
 13
 5 7 11 50 6 8 77 33 1 3 2 100 101
 Излез
 77

 Објаснување
 Во овој пример следниве елементи го задоволуваат условот:
 50(11<50 & 50>6)
 77(8<77 & 77>33)
 3(1<3 & 3>2)
 100 не го задоволува бараниот услов
 Најголем од броевите 50, 77 и 3 е 77.

 */